var R100_Data = {
    Categories: [
        {
            title: "生理方面",
            items: [
                { n:  1, q: "身體狀況長期不佳，常因病請假或缺課" },
                { n:  2, q: "由醫院診斷現罹患有慢性疾病" },
                { n:  3, q: "曾罹患過重大疾病" },
                { n:  4, q: "生理動作發展較一般孩子明顯的遲緩" },
                { n:  5, q: "體質特別差，無法在一般教室" },
                { n:  6, q: "生理狀況與一般同年齡孩子差異不大" }
            ]
        },
        {
            title: "感官動作方面",
            items: [
                { n:  7, q: "已領有身心障礙手冊" },
                { n:  8, q: "有嚴重視力問題" },
                { n:  9, q: "經常揉眼睛，看東西會瞇眼睛或貼課本或桌面貼得很近" },
                { n: 10, q: "發音不清楚，或聲調不對" },
                { n: 11, q: "經常要別人大聲說話或請人靠近一點再重說一遍" },
                { n: 12, q: "經常會跌倒或碰撞東西" },
                { n: 13, q: "動作明顯的比一般同學慢很多" },
                { n: 14, q: "不大會（或很少）拿剪刀、筷子等需要手部精細動作的工具" },
                { n: 15, q: "不大會（或很少）跳繩、走平衡木、打球或一般學校操場的體能活動" },
                { n: 16, q: "不太會獨立行走，需要輪椅、柺杖或家具等輔助工具或他人的協助" },
                { n: 17, q: "感官動作方面的發展與一般同年齡孩子差異不大，甚至更好" }
            ]
        },
        {
            title: "學業表現方面",
            items: [
                { n: 18, q: "整體學業成績長期（一學年以上）為全班最後五名" },
                { n: 19, q: "部份科目長期（一學年以上）為全班最後五名" },
                { n: 20, q: "學業表現經常起伏很大，可以由中等以上滑落到全班倒數" },
                { n: 21, q: "整體學業成績突然劇落，從此一蹶不振" },
                { n: 22, q: "部份學科劇落，從此一蹶不振" },
                { n: 23, q: "不會注音符號" },
                { n: 24, q: "不會認字，或會認讀的字很少（比一般同學少很多）" },
                { n: 25, q: "無法讀課本或考卷說明" },
                { n: 26, q: "閱讀不流暢" },
                { n: 27, q: "無法理解課文大意或複述閱讀內容的重點" },
                { n: 28, q: "會抄寫但不知字彙意義" },
                { n: 29, q: "寫字困難，連仿寫或抄聯絡簿有困難" },
                { n: 30, q: "不會寫出完整通順的句子" },
                { n: 31, q: "不會分類，如依據顏色、大小或形狀等性質區分" },
                { n: 32, q: "不會一對一的數數" },
                { n: 33, q: "只能背出20以下的數字" },
                { n: 34, q: "需要手指協助運算加減" },
                { n: 35, q: "會加減運算，但不會解應用問題" },
                { n: 36, q: "會加減，但不會乘除" },
                { n: 37, q: "會加減乘除的運算，但不會解應用問題" },
                { n: 38, q: "雖然學過小數、分數，但小數、分數或比例的概念差，不會運用" },
                { n: 39, q: "請務必選答此題。該生現有之學業表現大致如何？" },
                { n: "39-1", q: "　　整體學業：全班最後15%" },
                { n: "39-2", q: "　　　數學科：全班最後15%" },
                { n: "39-3", q: "　　　國語科：全班最後15%" }
            ]
        },
        {
            title: "學習能力方面",
            items: [
                { n: 40, q: "學習速度緩慢，明顯的比一般同班同學較差" },
                { n: 41, q: "記憶力差，記不住當天老師或父母的交代" },
                { n: 42, q: "注意力差．不易持續專心任何活動" },
                { n: 43, q: "組織力差，說話或做事顯得凌亂，沒有重點與組織" },
                { n: 44, q: "理解能力差，常弄不清楚抽象或較複雜的符號或詞彙" },
                { n: 45, q: "學習能力在不同事物表現差異很大，對某些科目或事物表現得特別好" },
                { n: 46, q: "記憶力好,尤其是對自己感興趣的事物" },
                { n: 47, q: "學習能力大致與一般同年齡的同學差不多，甚至更好" }
            ]
        },
        {
            title: "口語能力方面",
            items: [
                { n: 48, q: "口語能力表達差，無法與老師或同學溝通" },
                { n: 49, q: "聽話理解能力差，常抓不到老師或同學說話的重點" },
                { n: 50, q: "不太能和別人閒談，不太能接續別人的話題" },
                { n: 51, q: "說話不清楚，一般人不易聽得懂" },
                { n: 52, q: "不喜歡聽人講解，聽課比自己看書學習時顯得不專心" },
                { n: 53, q: "經常重複簡單的詞彙或短句" },
                { n: 54, q: "不會主動表達自己的需求" },
                { n: 55, q: "口語能力與一般同年齡的同學差不多" }
            ]
        },
        {
            title: "團體生活方面",
            items: [
                { n: 56, q: "上課經常會隨意離開座位或教室" },
                { n: 57, q: "上課經常沒有反應、呆坐或打瞌睡" },
                { n: 58, q: "無法參與團體活動（遊戲、比賽）" },
                { n: 59, q: "喜歡一個人獨處或自己玩" },
                { n: 60, q: "下課經常一個人，沒有人和他玩" },
                { n: 61, q: "上課會亂出聲、走動或作弄別人而影響教室學習" },
                { n: 62, q: "愛頂嘴，公開頂撞師長的指示" },
                { n: 63, q: "經常不交作業或不做掃地工作" },
                { n: 64, q: "會蹺課、逃家或逃學" },
                { n: 65, q: "霸道，經常要別人讓他，不能忍受同學的不一樣或打擾" },
                { n: 66, q: "班上大多數同學都討厭他，會拒絕與他同座或在一起" },
                { n: 67, q: "在學校與同學相處方面和一般同年齡孩子差不多" }
            ]
        },
        {
            title: "個人生活適應方面",
            items: [
                { n: 68, q: "髒亂、無法維持個人衛生" },
                { n: 69, q: "不會自行穿脫衣服" },
                { n: 70, q: "不會自行上廁所，會遺尿或大便在褲子上" },
                { n: 71, q: "應變能力差，經常不會隨著情境調整自己的行為或態度" },
                { n: 72, q: "動作速度經常跟不上教室（或班級團體）的活動腳步" },
                { n: 73, q: "不會自行由教室到廁所、福利社或學校內其他的地方" },
                { n: 74, q: "上課鐘響經常不會自行回教室" },
                { n: 75, q: "經常忘記帶上課需要的文具、書本或繳交的作業" },
                { n: 76, q: "經常遺失個人物品，不會保管自己的東西" },
                { n: 77, q: "在學校所從事的活動（休閒或社交活動）比一般同學少很多" },
                { n: 78, q: "對於環境不預期的變化（如調課、換座位）會有明顯不適應的反應" },
                { n: 79, q: "可以像一般同年齡的同學照顧自己" }
            ]
        },
        {
            title: "行為情緒適應方面",
            items: [
                { n: 80, q: "情緒表達不適當，和情境不合" },
                { n: 81, q: "退縮、膽子很小" },
                { n: 82, q: "脾氣很大，經常會生很大的脾氣、罵人" },
                { n: 83, q: "經常攻擊同學或破壞物品" },
                { n: 84, q: "一不滿意，就會哭鬧不停" },
                { n: 85, q: "比一般同學更容易緊張、焦慮" },
                { n: 86, q: "不會保護自己，經常受同學欺負或佔小便宜" },
                { n: 87, q: "待人處事或行為舉止顯得比一般同學幼稚、不成熟" },
                { n: 88, q: "對周遭的人或活動不太有反應，好像不感興趣" },
                { n: 89, q: "經常重複出現相同的動作、或發出相同的聲音" },
                { n: 90, q: "老師、同學生氣或受傷時,不會表現出關心或擔心的行為" },
                { n: 91, q: "對周遭的人感興趣，但表現的很奇怪，令人受不了" },
                { n: 92, q: "行為與情緒表達與一般同年齡同性別的同學差不多" }
            ]
        },
        {
            title: "家庭與社區方面",
            items: [
                { n: 93, q: "曾經長期（一年以上）居住在國外或偏遠地區" },
                { n: 94, q: "放學後沒有人可以提供課業上的協助或督導" },
                { n: 95, q: "放學後沒有人會監控學生的行動" },
                { n: 96, q: "期不和父母雙親同居住在一起" },
                { n: 97, q: "家庭經濟清寒（屬於社會局低收入戶或主要家長長期失業）" },
                { n: 98, q: "家庭居住環境充滿不好的影響（例如：電動玩具店、色情或賭博行業、幫派或犯罪組織）" },
                { n: 99, q: "父親或母親是外國籍或原住民" },
                { n: 100, q: "家庭狀況與一般同學差不多，或是更好" }
            ]
        }
    ],
    ResultSettings: [
        {
            title: "身體病弱",
            count_items: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
            threshold: null
        },
        {
            title: "視覺障礙",
            count_items: [7, 8, 9, 12, 72, 73, 74, 75, 76],
            threshold: null
        },
        {
            title: "聽覺障礙",
            count_items: [7, 10, 11, 48, 49, 50, 51, 52],
            threshold: null
        },
        {
            title: "動作問題",
            count_items: [12, 13, 14, 15, 16],
            threshold: null
        },
        {
            title: "智能障礙",
            count_items: [7, 10, 10, 18, 23, 23, 24, 25, 26, 27, 28, 30, 30, 35, 38, 40, 41, 41, 43, 44, 49, 49, 55, 67, 81, 81],
            threshold: 6
        },
        {
            title: "學習障礙",
            count_items: [17, 17, 18, 19, 19, 24, 26, 28, 35, 38, 40, 44, 55, 57, 57, 63, 67, 79, 79, 92, 92],
            threshold: 6
        },
        {
            title: "情緒障礙",
            count_items: [20, 20, 42, 52, 60, 61, 62, 62, 63, 65, 65, 66, 66, 80, 82, 82, 83, 83, 87, 91],
            threshold: 4
        },
        {
            title: "ADHD",
            count_items: [20, 42, 43, 60, 61, 62, 63, 75, 76, 80, 89],
            threshold: 4
        },
        {
            title: "自閉症",
            count_items: [7, 14, 14, 15, 15, 25, 27, 42, 43, 44, 46, 46, 52, 53, 53, 58, 58, 59, 59, 60, 61, 71, 71, 72, 72, 77, 77, 80, 85, 85, 87, 88, 88, 89, 89, 90, 90, 91],
            threshold: 6
        },
        {
            title: "疑似OLLD<br />口語語言學障",
            count_items: [48, 49, 50, 51, 52, 53, 54],
            threshold: 3
        },
        {
            title: "疑似RLD<br />閱讀學障",
            count_items: [23, 24, 25, 26, 27, "39-3"],
            threshold: 3
        },
        {
            title: "疑似WLLD<br />書寫語文學障",
            count_items: [28, 29, 30, "39-3"],
            threshold: 2
        },
        {
            title: "疑似MLD<br />數學學障",
            count_items: [31, 32, 33, 34, 35, 36, 37, 38, "39-2"],
            threshold: 4
        },
        {
            title: "疑似NVLD<br />(社會情緒)",
            count_items: [40, 41, 42, 43, 44, 71, 73, 74, 78],
            threshold: 3
        },
        {
            title: "疑似NVLD<br />(外顯行為)",
            count_items: [12, 13, 14, 15, 69, 72],
            threshold: 3
        }
    ]
};

(function updateScores(){
    for(var i = 0; i < R100_Data.ResultSettings.length; i++) {
        var item = R100_Data.ResultSettings[i];
        var scores = {};
        for(var j = 0; j < item.count_items.length; j++) {
            var n = item.count_items[j];
            scores[n] = scores.hasOwnProperty(n) ? scores[n] + 1 : 1;
        }
        item.scores = scores;
    }
})();
